//  Задание 1. Напишите программу, которая работала бы следующим образом: в prompt вводится значение. 
//  С помощью унарного плюса (арифметический оператор) необходимо преобразовать его в число, затем проверить с помощью typeof, 
//  принадлежит ли оно к множеству Number.
//  Если это число, то вывести в консоль чётное оно или нечётное.
//  Если передано не число, выведите: «Упс, кажется, вы ошиблись».
//  *NaN, хоть и относится к типу Number, числом не является. Добавьте отдельную проверку для этого значения.

let enteredNum = prompt ('Введите значение');
enteredNum = + enteredNum;
console.log(enteredNum + ' is ' + typeof enteredNum);
if (enteredNum) {
  let check = enteredNum % 2;
  if (check == 0) {
   console.log('Число ' + enteredNum + ' четное');
   } else {
   console.log('Число ' + enteredNum + ' не четное'); 
   }
   }  else {
   console.log('Упс, кажется, вы ошиблись');
}
if (isNaN(enteredNum)) {
  console.log('Введите число!')
}